[
    {
        "index": 0,
        "text": "Improving Capacity and Revenue through Effective Room Management Healthcare Leaders Experiencing Exam Room Utilization Challenges, Leading to Revenue Loss W H I T E PA P E R Copyright © 2024 QGenda, LLC All rights reserved."
    },
    {
        "index": 1,
        "text": "Copyright © 2024 QGenda, LLC All rights reserved. As healthcare leaders reimagine patient access and care delivery in a post-pandemic world, there is an emerging story around the need to optimize clinic exam room utilization. Better utilization can improve operating efficiency, patient satisfaction, and revenue capture. The 2020 Porter Research study of 100 health system executive leaders identified the many challenges faced today with exam room scheduling, future expectations for optimizing exam rooms, and the impact that proper exam room scheduling can have on a health system's P&L. Increasing Scrutiny on Clinic Exam Rooms With the limited funds available for health system capital expenditures, executives must optimize their existing physical space while simultaneously remaining adaptable to fluctuations in patient demand. In the short term, health systems may experience an influx of patients who delayed elective surgeries, treatments for minor health issues, and preventative visits due to COVID-19. As a result, clinics could be overwhelmed. Patients may experience significant wait times and cumbersome appointment rescheduling. Inefficient scheduling could result in additional revenue leakage, because patients who cannot secure timely appointments at their first-choice location may decide to go elsewhere. In the longer term, executives will need to focus on closing a 20-point utilization gap. Health system executives surveyed identified optimal exam room utilization to be between 80 and 89%. However, 72% of respondents indicated their clinics were operating well under the optimal level. Generally, executives identified a 20-point gap between their clinics' utilization and the optimal utilization level. The direct impact to health system revenue can be dramatic. The Orthopedic Director at a large regional health system quantified lost revenue attributable to this gap: \"Our providers see 25 to 30 patients per day, when in reality, we could see 35 to 40 patients. Given our average billing, there is a minimum of $2,000 per provider per day that we are not able to realize due to exam room underutilization.\" 2 Clinic Exam Room Utilization Current 40% 0% 30% 20% 10% <60 61-69 70-79 80-89 90-100 Unsure 5% 16% 34% 22% 20% 3% Optimal Utilization"
    },
    {
        "index": 2,
        "text": "Copyright © 2024 QGenda, LLC All rights reserved. As health systems return to typical operating levels, it will be important to focus on improving room utilization for the long term. For example, closing the utilization gap means that health systems can increase patient throughput without having to invest in new rooms or buildings or hire new staff. As the VP of Oncology Services at a large health system explained: \"If I can increase my exam room utilization by 20%, given my operational expenses, I could save $200,000 per clinic. With 14 clinics, that means $2.8 million in annual savings.\" While it may take time to fully close the utilization gap, even small improvements are meaningful. At this health system for example, each 1% increase in utilization results in a savings of $140,000 per year that can drop to the bottom line or be invested in revenue-producing activities. This missed opportunity is why 70% of executives surveyed expressed a sincere interest in solutions that close the clinic and exam room utilization gap. 3 Technology Not Meeting the Need Proper exam room management is challenging. This is partially because of process and partially because most health systems do not have access to exam room scheduling technologies that are purpose-built to optimize physical space. Thirty percent of respondents reported they do not use any software to manage their exam rooms and require staff to develop processes unique to each department. Another 20% use Microsoft Excel. The remaining 50% use other technologies that are not intentionally designed for exam room scheduling. \" If I can increase my exam room utilization by 20%, given my operational expenses, I could save $200,000 per clinic. With 14 clinics, that means $2.8 million in annual savings. - VP of Oncology Services at Large Health System Current Clinic/Exam Room Scheduling Solution No Technology / Solution in Place Microsoft Excel Other 53% 30% 17%"
    },
    {
        "index": 3,
        "text": "Copyright © 2024 QGenda, LLC All rights reserved. As a result, over half of our respondents reported experiencing major difficulties with their current exam room scheduling solutions. Management of exam rooms is considered time-intensive, and the technology is difficult to use and error-prone. The result is outdated or incorrect information and the inability to positively impact utilization. Transparency is also a key roadblock. Executives routinely cite the lack of analytics required to even understand their current exam room utilization. These issues are compounded when each department uses a separate scheduling system, further limiting transparency and a clinic's ability to fully utilize exam rooms across departments. As a result, only 31% of health system executives report being happy with their current solution. This lack of proper scheduling causes unnecessary delays and limits patient throughput. If significant wait times pervade a health system at an enterprise level, patients may go elsewhere for care. Measure for Optimal Performance To maximize the investment in new processes and exam room scheduling technology, health systems must set utilization targets, measure, and make changes needed to achieve goals. As most healthcare executives agree, clinics should be targeting a utilization level above 80%. 4 Practical Guidance: Four Things Health Systems Can Do Today to Optimize Exam Room Utilization Forward-thinking executives are considering investments in process and technology that optimize exam room utilization now. In fact, 70% of those surveyed expressed an interest in solutions that can solve their exam room underutilization challenges. Here are four critical considerations when investing in exam room management solutions: Digitize for Greater Real-time Visibility Digitize schedules to ensure they are up-to-date and adjusted in real-time, giving full transparency to all stakeholders and providing visibility into potential changes. When applied at the enterprise level, the impact of this new transparency can dramatically expand the number of available rooms and increase patient throughput. Standardize for Better Analysis Standardize your scheduling process and terminology to a common language for users, and implement a management system that allows you to properly benchmark and track common utilization metrics by department. At the enterprise level, a standardized process means departments can more easily share space, resulting in even greater productivity gains. Automate to Drive Efficiency In every clinical context, there are multiple teams of administrators that coordinate different aspects of the room scheduling process. Automate to ease the burden on staff and reduce the number of FTEs required to add new providers, repurpose rooms, and address schedule changes, while keeping records up-to-date. Top Challenges with Exam Room Utilization Challenges Time-intensive to manage Overall Doesn't integrate with other systems Expensive No positive effect on utilization Poor transparency / access Outdated or incorrect information Difficult to use Error-prone Other 19% 18% 14% 13% 13% 9% 7% 4% 3%"
    },
    {
        "index": 4,
        "text": "Copyright © 2024 QGenda, LLC All rights reserved. At a time when every dollar counts, health systems should be investing in scheduling solutions that optimize exam room utilization. The most important expected outcomes, as shown in the pie chart, can be generally grouped into three categories: 5 Defined Outcomes from Exam Room Optimization Implementing an exam room management system will improve clinic room utilization and increase operational efficiencies, enhancing patient access to care and positioning health systems to successfully adapt to the new healthcare environment. Patient throughput will be increased in a cost-effective manner, thereby increasing operating income. Now is the time to take a holistic approach to capacity management and evaluate scheduling technologies that are purpose-built to optimize exam room utilization. In Conclusion Time is saved and the opportunity for human error, such as double-bookings and empty rooms that result when schedules are kept in silos, is reduced. Unnecessary back-and-forth communication between clinics, departments, providers, and patients decreases. Administrators can collect the data they need to understand utilization trends and address problem areas. The result is that overhead budgets can be reduced or reallocated to more productive services. Operational Efficiency Patients can access care sooner and spend less time in the waiting room, leading to higher satisfaction and greater likelihood to return in the future. Providers will have the flexibility to see more patients and better allocate their time between locations, which means more billable services per provider. Patient & Provider Satisfaction & Retention Patient throughput is increased with the same number of rooms, eliminating the need for additional capital expenditure. Billing is increased either among existing providers or by expanding the number of providers, without incremental investment in real estate. The reduction in overhead cost that was associated with unused exam room time drops right to the bottom line. Profit Maximization Most Important Outcomes Maximize Profit Operational Efficiency Patient & Provider Satisfaction & Retention 54% 25% 21%"
    },
    {
        "index": 5,
        "text": "About QGenda QGenda revolutionizes healthcare workforce management everywhere care is delivered. QGenda ProviderCloud, a purpose-built healthcare platform that empowers customers to effectively deploy workforce resources, includes solutions for scheduling, credentialing, on-call scheduling, room and capacity management, time tracking, compensation management, and workforce analytics. More than 4,500 organizations partner with QGenda to advance provider scheduling, optimize capacity, and improve access to care. QGenda is headquartered in Atlanta, Georgia. Learn more at www.QGenda.com About Porter Research Porter Research works with healthcare and IT companies to develop and execute market research programs and create strategies using market intelligence uncovered. With 30 years of experience, we have worked with more than 300 IT companies, and complete thousands of interviews each year. This means we know your industry, we know how you need to use the data, and we execute the right research program to uncover what you can't find on your own. For more information visit www.porterresearch.com Learn how QGenda can help improve exam room utilization and increase operational efficiencies. www.QGenda.com/clinic-exam-room-capacity Copyright © 2024 QGenda, LLC All rights reserved. 6"
    }
]